Terraform plan for __staging__
<details>
<summary>Plan: 4 to add, 0 to change, 2 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # google_service_account_iam_member.bff_service_account will be destroyed
  - resource "google_service_account_iam_member" "bff_service_account" {
      - etag               = "BwXXan1nGo0=" -> null
      - id                 = "projects/ebo-staging/serviceAccounts/bff-services@ebo-staging.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/serviceAccount:ebo-staging.svc.id.goog[ebo/bff-services]" -> null
      - member             = "serviceAccount:ebo-staging.svc.id.goog[ebo/bff-services]" -> null
      - role               = "roles/iam.workloadIdentityUser" -> null
      - service_account_id = "projects/ebo-staging/serviceAccounts/bff-services@ebo-staging.iam.gserviceaccount.com" -> null
    }

  # google_service_account_iam_member.bff_service_account["beta"] will be created
  + resource "google_service_account_iam_member" "bff_service_account" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:ebo-staging.svc.id.goog[beta/bff-services]"
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = "*************************************************************************************"
    }

  # google_service_account_iam_member.bff_service_account["ebo"] will be created
  + resource "google_service_account_iam_member" "bff_service_account" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:ebo-staging.svc.id.goog[ebo/bff-services]"
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = "*************************************************************************************"
    }

  # kubernetes_service_account.bff_service_account will be destroyed
  - resource "kubernetes_service_account" "bff_service_account" {
      - automount_service_account_token = true -> null
      - default_secret_name             = "bff-services-token-fn54g" -> null
      - id                              = "ebo/bff-services" -> null

      - metadata {
          - annotations      = {
              - "iam.gke.io/gcp-service-account" = "bff-services@ebo-staging.iam.gserviceaccount.com"
            } -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "bff-services" -> null
          - namespace        = "ebo" -> null
          - resource_version = "105024177" -> null
          - uid              = "2d00c3b1-6a56-48cd-907d-f030eec71e01" -> null
        }
    }

  # kubernetes_service_account.bff_service_account["beta"] will be created
  + resource "kubernetes_service_account" "bff_service_account" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = {
              + "iam.gke.io/gcp-service-account" = "bff-services@ebo-staging.iam.gserviceaccount.com"
            }
          + generation       = (known after apply)
          + name             = "bff-services"
          + namespace        = "beta"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_service_account.bff_service_account["ebo"] will be created
  + resource "kubernetes_service_account" "bff_service_account" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = {
              + "iam.gke.io/gcp-service-account" = "bff-services@ebo-staging.iam.gserviceaccount.com"
            }
          + generation       = (known after apply)
          + name             = "bff-services"
          + namespace        = "ebo"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 2 to destroy.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

:memo: Plan generated in [Terraform #432](https://github.com/ebomart/commerce-infrastructure/actions/runs/1810531627)